DECLARE 01 GRP_LAYOUT FB,
         03 EXTRACT_DATE     FIXED(9),
         03 EXTRACT_TIME     FIXED(7),
         03 ITEM             CHAR(7),
         03 LOC              CHAR(5),
         03 DRPCOVDUR        FIXED(5),
         03 EXTERNALSKUSW    PIC'9',
         03 PLANDUR          FIXED(5),
         03 PLANLEADTIME     FIXED(5),
         03 OH               FIXED(9,1),
         03 OHPOST           FIXED(9),
         03 SSCOV            FIXED(5),
         03 STATSS           FIXED(9,1),
         03 MINDRPQTY        FIXED(9,1),
         03 INCDRPQTY        FIXED(9,1),
         03 CURCOVDUR        FIXED(5),
         03 MAXPROJOH        FIXED(9,1),
         03 MAXPROJOHDATE    FIXED(9),
         03 CHANNEL          CHAR(2),
         03 DRPTIMEFENCEDATE FIXED(9),
         03 VENDOR           CHAR(4),
         03 MAXSS            FIXED(9,1),
         03 SUB_MODE         CHAR(10),
         03 COUNTRY_CODE     CHAR(3),
         03 CPFR             PIC'9',
         03 TRUCKLOAD_MIN    FIXED(9),
         03 TRUCKLOAD_MAX    FIXED(9),
         03 BACKORDERS       FIXED(9,1),
         03 STOCKOUTDATE     FIXED(9),
         03 STOCKOUTDUR      FIXED(5),
         03 STOCKOUTQTY      FIXED(9,1),
         03 MINSS            FIXED(9,1),
         03 CM_NUMBER        CHAR(3),

         03 FINELINE_CAT     CHAR(5),
         03 SCA_NUMBER       CHAR(3),
         03 COMMENTS         CHAR(50);
